/*
בעל חברה מעוניין לדעת מה היו הוצאותיו החודשיות למשכורות עובדיו.

לכל עובד יש לקלוט את מספר השעות שעבד ואת התעריף לשעה.

אם העובד עבד יותר מ-150 שעות, הוא מקבל בונוס של 250 שקל.

הקלט יסתיים כאשר מספר השעות והתעריף לשעה יהיו 999-.

פתח ויישם אלגוריתם שיקלוט את נתוני העובדים ויציג כפלט:

א) מהן הוצאותיו של בעל המפעל?

ב) מהי המשכורת הממוצעת?
*/

var num = Math.floor(Math.random()*1000);
console.log(num);
var sum = 0;
while (true) {
    sum += num;
    if (num == -99)
        break;
    num--;
}
console.log(sum)

/* for style
var sum = 0;
for(var num = Math.floor(Math.random()*1000); num == -99; num--) {
    sum += num;
    if (num == -99)
        break;
}
*/